#include<iostream>
using namespace std;
#define tab "\t"


void main()
{
	setlocale(LC_ALL, "Russian");

	//В Solution "Arrays" добавить проект "Shift", в котором нужно решить следующую задачу :
	//Есть массив из 10 элементов, проинициализированный при объявлении числами : 1, 2, 3, ... 10.
	//	Нужно вывести этот массив на экран, затем циклически сдвинуть его на заданное число элементов влево или вправо,
	//	а затем вывести на экран сдвинутый массив :
	//Исходный массив :
	//1	2	3	4	5	6	7	8	9	10
	//	На сколько элементов сдвинуть массив : 3
	//	Сдвинутый массив :
	//4	5	6	7	8	9	10	1	2	3

	//	----------------------------------------------------------------------------------------------------
	//	1	2	3	4	5	6	7	8	9	10
	//	2	3	4	5	6	7	8	9	10	1
	//	3	4	5	6	7	8	9	10	1	2
	//	4	5	6	7	8	9	10	1	2	3
	//	----------------------------------------------------------------------------------------------------
	const int SIZE = 10;
	int arr[SIZE] = { 1,2,3,4,5,6,7,8,9,10 };
	//Вывод исходного массива на экран
	for (int i = 0; i < SIZE; i++)
	{
		cout << arr[i] << tab;
	}
	cout << endl;
	cout << "------------------------------------------------------------------------------ " << endl;
	int shift;
	cout << "Введите на какое количество элементов сдвинуть массив: \n"; cin >> shift;
	for (int i = 0; i < shift; i++)
	{

		//Сдвиг массива
		int temp = arr[SIZE - 1];
		for (int i = SIZE - 2; i >= 0; i--)
		{
			arr[i + 1] = arr[i];
		}
		arr[0] = temp;

		//Вывод сдвинутого массива на экран
		for (int i = 0; i < SIZE; i++)
		{
			cout << arr[i] << tab;
		}
		cout << endl;
	}
}